{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Flatten", "config": {"name": "flatten_33", "batch_input_shape": [null, 28, 28, 1], "trainable": true, "input_dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "p": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_33", "bias": true, "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": 784, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "W_regularizer": null, "W_constraint": null}}]}