{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 3, "subsample": [1, 1], "nb_filter": 32, "dim_ordering": "tf", "input_dtype": "float32", "b_constraint": null, "bias": true, "activation": "relu", "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "name": "convolution2d_18", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "W_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_10", "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_29", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_28", "bias": true, "activation": "relu", "b_constraint": null, "activity_regularizer": null, "input_dim": 5408, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 128, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_29", "bias": true, "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": 128, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "W_regularizer": null, "W_constraint": null}}]}